RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_rcc.c
  if (tmp == 1)            
  {
    statusreg = RCC->CTLR;
  }
  else if (tmp == 2)       
  {
    statusreg = RCC->BDCTLR;
  }
  else                    
  {
    statusreg = RCC->RSTSCKR;
  }

  tmp = RCC_FLAG & FLAG_Mask;
	
  if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*******************************************************************************
* Function Name  : RCC_ClearFlag
* Description    : Clears the RCC reset flags.
* Input          : None
* Return         : None
*******************************************************************************/
void RCC_ClearFlag(void)
{
  RCC->RSTSCKR |= RSTSCKR_RMVF_Set;
}

/*******************************************************************************
* Function Name  : RCC_GetITStatus
* Description    : Checks whether the specified RCC interrupt has occurred or not.
* Input          : RCC_IT: specifies the RCC interrupt source to check.
*                    RCC_IT_LSIRDY: LSI ready interrupt.
*                    RCC_IT_LSERDY: LSE ready interrupt.
*                    RCC_IT_HSIRDY: HSI ready interrupt.
*                    RCC_IT_HSERDY: HSE ready interrupt.
*                    RCC_IT_PLLRDY: PLL ready interrupt.
*                    RCC_IT_PLL2RDY: PLL2 ready interrupt.
*                    RCC_IT_PLL3RDY: PLL3 ready interrupt.
*                    RCC_IT_CSS: Clock Security System interrupt.
* Return         : ITStatus: SET or RESET.
*******************************************************************************/	
ITStatus RCC_GetITStatus(uint8_t RCC_IT)
{
  ITStatus bitstatus = RESET;

  if ((RCC->INTR & RCC_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }

  return  bitstatus;
}

/*******************************************************************************
* Function Name  : RCC_ClearITPendingBit
* Description    : Clears the RCC's interrupt pending bits.
* Input          : RCC_IT: specifies the interrupt pending bit to clear.
*                    RCC_IT_LSIRDY: LSI ready interrupt.
*                    RCC_IT_LSERDY: LSE ready interrupt.
*                    RCC_IT_HSIRDY: HSI ready interrupt.
*                    RCC_IT_HSERDY: HSE ready interrupt.
*                    RCC_IT_PLLRDY: PLL ready interrupt.
*                    RCC_IT_PLL2RDY: PLL2 ready interrupt.
*                    RCC_IT_PLL3RDY: PLL3 ready interrupt.
*                    RCC_IT_CSS: Clock Security System interrupt.
* Return         : None
*******************************************************************************/	
void RCC_ClearITPendingBit(uint8_t RCC_IT)
{
  *(__IO uint8_t *) INTR_BYTE3_ADDRESS = RCC_IT;
}

/*******************************************************************************
* Function Name  : RCC_PREDIV1Config
* Description    : Configures the PREDIV1 division factor.
* Input          : RCC_PREDIV1_Source: specifies the PREDIV1 clock source.
*                    RCC_PREDIV1_Source_HSE: HSE selected as PREDIV1 clock
*                    RCC_PREDIV1_Source_PLL2: PLL2 selected as PREDIV1 clock
*                  RCC_PREDIV1_Div: specifies the PREDIV1 clock division factor.
*   This parameter can be RCC_PREDIV1_Divx where x:[1,16]
* Return         : None
*******************************************************************************/
void RCC_PREDIV1Config(uint32_t RCC_PREDIV1_Source, uint32_t RCC_PREDIV1_Div)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR2;
  tmpreg &= ~(CFGR2_PREDIV1 | CFGR2_PREDIV1SRC);
  tmpreg |= RCC_PREDIV1_Source | RCC_PREDIV1_Div ;
  RCC->CFGR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : RCC_PREDIV2Config
* Description    : Configures the PREDIV2 division factor.
* Input          : RCC_PREDIV2_Div: specifies the PREDIV2 clock division factor.
*   This parameter can be RCC_PREDIV2_Divx where x:[1,16]
* Return         : None
*******************************************************************************/
void RCC_PREDIV2Config(uint32_t RCC_PREDIV2_Div)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR2;
  tmpreg &= ~CFGR2_PREDIV2;
  tmpreg |= RCC_PREDIV2_Div;
  RCC->CFGR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : RCC_PLL2Config
* Description    : Configures the PLL2 multiplication factor.
* Input          : RCC_PLL2Mul: specifies the PLL2 multiplication factor.
*         This parameter can be RCC_PLL2Mul_x where x:{[8,14], 16, 20}
* Return         : None
*******************************************************************************/
void RCC_PLL2Config(uint32_t RCC_PLL2Mul)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR2;
  tmpreg &= ~CFGR2_PLL2MUL;
  tmpreg |= RCC_PLL2Mul;
  RCC->CFGR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : RCC_PLL2Cmd
* Description    : Enables or disables the PLL2.
* Input          : NewState: new state of the PLL2. This parameter can be: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_PLL2Cmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= ((uint32_t)1<<26);
    }
    else{
        RCC->CTLR &= ~((uint32_t)1<<26);
    }
}

/*******************************************************************************
* Function Name  : RCC_PLL3Config
* Description    : Configures the PLL3 multiplication factor.
* Input          : RCC_PLL3Mul: specifies the PLL3 multiplication factor.
*         This parameter can be RCC_PLL3Mul_x where x:{[8,14], 16, 20}
* Return         : None
*******************************************************************************/
void RCC_PLL3Config(uint32_t RCC_PLL3Mul)
{
  uint32_t tmpreg = 0;

  tmpreg = RCC->CFGR2;
  tmpreg &= ~CFGR2_PLL3MUL;
  tmpreg |= RCC_PLL3Mul;
  RCC->CFGR2 = tmpreg;
}

/*******************************************************************************
* Function Name  : RCC_PLL3Cmd
* Description    : Enables or disables the PLL3.
* Input          : NewState: new state of the PLL3. This parameter can be: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_PLL3Cmd(FunctionalState NewState)
{
    if(NewState)
    {
        RCC->CTLR |= ((uint32_t)1<<28);
    }
    else{
        RCC->CTLR &= ~((uint32_t)1<<28);
    }
}

