RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_rcc.c
/*******************************************************************************
* Function Name  : RCC_OTGFSCLKConfig
* Description    : Configures the USB OTG FS clock (OTGFSCLK).
* Input          : RCC_OTGFSCLKSource: specifies the USB OTG FS clock source.
*                  RCC_OTGFSCLKSource_PLLCLK_Div1: PLL clock divided by 1 selected as USB OTG FS clock source
*                  RCC_OTGFSCLKSource_PLLCLK_Div2: PLL clock divided by 2 selected as USB OTG FS clock source
*                  RCC_OTGFSCLKSource_PLLCLK_Div3: PLL clock divided by 3 selected as USB OTG FS clock source
* Return         : None
*******************************************************************************/
void RCC_OTGFSCLKConfig(uint32_t RCC_OTGFSCLKSource)
{
    RCC->CFGR0 &= ~((uint32_t)3<<22);
    RCC->CFGR0 |= RCC_OTGFSCLKSource<<22;
}

/*******************************************************************************
* Function Name  : RCC_I2S2CLKConfig
* Description    : Configures the I2S2 clock source(I2S2CLK).
* Input          : RCC_I2S2CLKSource: specifies the I2S2 clock source.
*                  RCC_I2S2CLKSource_SYSCLK: system clock selected as I2S2 clock entry
*                  RCC_I2S2CLKSource_PLL3_VCO: PLL3 VCO clock selected as I2S2 clock entry
* Return         : None
*******************************************************************************/
void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)1<<17);
    RCC->CFGR2 |= RCC_I2S2CLKSource<<17;
}

/*******************************************************************************
* Function Name  : RCC_I2S3CLKConfig
* Description    : Configures the I2S3 clock source(I2S2CLK).
* Input          : RCC_I2S3CLKSource: specifies the I2S3 clock source.
*                  RCC_I2S3CLKSource_SYSCLK: system clock selected as I2S3 clock entry
*                  RCC_I2S3CLKSource_PLL3_VCO: PLL3 VCO clock selected as I2S3 clock entry
* Return         : None
*******************************************************************************/
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)1<<18);
    RCC->CFGR2 |= RCC_I2S3CLKSource<<18;
}

/*******************************************************************************
* Function Name  : RCC_AHBPeriphResetCmd
* Description    : Forces or releases AHB peripheral reset.
* Input          : RCC_AHBPeriph: specifies the AHB peripheral to reset.
*                  RCC_AHBPeriph_OTG_FS
*                  RCC_AHBPeriph_ETH_MAC
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_AHBPeriphResetCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->AHBRSTR |= RCC_AHBPeriph;
  }
  else
  {
    RCC->AHBRSTR &= ~RCC_AHBPeriph;
  }
}

/*******************************************************************************
* Function Name  : RCC_ADCCLKADJcmd
* Description    : Enable ADC clock duty cycle adjustment.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_ADCCLKADJcmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->CFGR0 |= ((uint32_t)1<<31);
  }
  else
  {
    RCC->CFGR0 &= ~((uint32_t)1<<31);
  }
}

/*******************************************************************************
* Function Name  : RCC_RNGCLKConfig
* Description    : Configures the RNG clock source.
* Input          : RCC_RNGCLKSource: specifies the RNG clock source.
*                  RCC_RNGCLKSource_SYSCLK: system clock selected as RNG clock entry
*                  RCC_RNGCLKSource_PLL3_VCO: PLL3 VCO clock selected as RNG clock entry
* Return         : None
*******************************************************************************/
void RCC_RNGCLKConfig(uint32_t RCC_RNGCLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)1<<19);
    RCC->CFGR2 |= RCC_RNGCLKSource<<19;
}

/*******************************************************************************
* Function Name  : RCC_ETH1GCLKConfig
* Description    : Configures the ETH1G clock source.
* Input          : RCC_RNGCLKSource: specifies the ETH1G clock source.
*                  RCC_ETH1GCLKSource_PLL2_VCO: system clock selected as ETH1G clock entry
*                  RCC_ETH1GCLKSource_PLL3_VCO: PLL3 VCO clock selected as ETH1G clock entry
*                  RCC_ETH1GCLKSource_PB1_IN£º GPIO PB1 input clock selected as ETH1G clock entry
* Return         : None
*******************************************************************************/
void RCC_ETH1GCLKConfig(uint32_t RCC_ETH1GCLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)3<<20);
    RCC->CFGR2 |= RCC_ETH1GCLKSource<<20;
}

/*******************************************************************************
* Function Name  : RCC_ETH1G_125Mcmd
* Description    : Enable ETH1G 125M.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_ETH1G_125Mcmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->CFGR2 |= ((uint32_t)1<<22);
  }
  else
  {
    RCC->CFGR2 &= ~((uint32_t)1<<22);
  }
}

/*******************************************************************************
* Function Name  : RCC_USBHSConfig
* Description    : Configures the USBHS clock.
* Input          : RCC_USBHS: defines the USBHS clock divider.
*                    RCC_USBPLL_Div1: USBHS clock = USBPLL.
*                    RCC_USBPLL_Div2: USBHS clock = USBPLL/2.
*                    RCC_USBPLL_Div3: USBHS clock = USBPLL/3.
*                    RCC_USBPLL_Div4: USBHS clock = USBPLL/4.
*                    RCC_USBPLL_Div5: USBHS clock = USBPLL/5.
*                    RCC_USBPLL_Div6: USBHS clock = USBPLL/6.
*                    RCC_USBPLL_Div7: USBHS clock = USBPLL/7.
*                    RCC_USBPLL_Div8: USBHS clock = USBPLL/8.
* Return         : None
*******************************************************************************/
void RCC_USBHSConfig(uint32_t RCC_USBHS)
{
    RCC->CFGR2 &= ~((uint32_t)7<<24);
    RCC->CFGR2 |= RCC_USBHS<<24;
}

