RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_rcc.c
/*******************************************************************************
* Function Name  : RCC_USBHSPLLCLKConfig
* Description    : Configures the USBHSPLL clock source.
* Input          : RCC_RNGCLKSource: specifies the USBHSPLL clock source.
*                  RCC_HSBHSPLLCLKSource_HSE: HSE clock selected as USBHSPLL clock entry
*                  RCC_HSBHSPLLCLKSource_HSI: HSI clock selected as USBHSPLL clock entry
* Return         : None
*******************************************************************************/
void RCC_USBHSPLLCLKConfig(uint32_t RCC_USBHSPLLCLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)1<<27);
    RCC->CFGR2 |= RCC_USBHSPLLCLKSource<<27;
}

/*******************************************************************************
* Function Name  : RCC_USBHSPLLCKREFCLKConfig
* Description    : Configures the USBHSPLL reference clock.
* Input          : RCC_USBHSPLLCKREFCLKSource: Select reference clock.
*                  RCC_USBHSPLLCKREFCLK_3M: reference clock 3Mhz.
*                  RCC_USBHSPLLCKREFCLK_4M: reference clock 4Mhz.
*                  RCC_USBHSPLLCKREFCLK_8M: reference clock 8Mhz.
*                  RCC_USBHSPLLCKREFCLK_5M: reference clock 5Mhz.
* Return         : None
*******************************************************************************/
void RCC_USBHSPLLCKREFCLKConfig(uint32_t RCC_USBHSPLLCKREFCLKSource)
{
    RCC->CFGR2 &= ~((uint32_t)3<<28);
    RCC->CFGR2 |= RCC_USBHSPLLCKREFCLKSource<<28;
}

/*******************************************************************************
* Function Name  : RCC_USBHSPHYPLLALIVEcmd
* Description    : Enable USBHS PHY control.
* Input          : NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void RCC_USBHSPHYPLLALIVEcmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    RCC->CFGR2 |= ((uint32_t)1<<30);
  }
  else
  {
    RCC->CFGR2 &= ~((uint32_t)1<<30);
  }
}

/*******************************************************************************
* Function Name  : RCC_USBCLK48MConfig
* Description    : Configures the USB clock 48MHz source.
* Input          : RCC_USBCLK48MSource: specifies the USB clock 48MHz source.
*                  RCC_USBCLK48MCLKSource_PLLCLK: PLLCLK clock selected as USB clock 48MHz clock entry
*                  RCC_USBCLK48MCLKSource_USBPHY: USBPHY clock selected as USB clock 48MHz clock entry
* Return         : None
*******************************************************************************/
void RCC_USBCLK48MConfig(uint32_t RCC_USBCLK48MSource)
{
    RCC->CFGR2 &= ~((uint32_t)1<<31);
    RCC->CFGR2 |= RCC_USBCLK48MSource<<31;
}
